main.floors.L57=
{
    "floorId": "L57",
    "title": "魔塔外 - 57",
    "name": "魔塔外 - 57",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500,
    "defaultGround": "T625",
    "bgm": "7.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 600,
            "keep": true
        },
        {
            "type": "unfollow",
            "name": "mian.png"
        },
        {
            "type": "setBlock",
            "number": "N581",
            "loc": [
                [
                    7,
                    9
                ]
            ]
        },
        {
            "type": "changePos",
            "loc": [
                8,
                9
            ],
            "direction": "up"
        },
        "传说勇者 艾\n三岁修炼元素力量，六岁成为正式元素使，\n大幅刷新白月镇最年轻元素使的记录。",
        "惊为天人的天赋、披星戴月的努力、低调的为人。\n他立志扫清白月镇之外的威胁，\n为整个镇子换来和平。",
        "八岁时，带领最初代的一批勇者，\n出征清剿周遭的异兽，\n单枪匹马杀入敌营，越阶击杀了敌方的指挥者。",
        "九岁突破大元素使，\n令得数百里之内的兽王谈其色变，\n联合对白月镇展开围剿，却一次又一次被他粉碎。",
        "他越来越强，像一位战神一般，转眼又是三年。\n那一天，临近区域最作恶多端的凶兽，被他一招斩灭！\n众兽王不得不举族迁徙，白月镇终于迎来了和平的时代。",
        "那一年，十三岁的艾，\n建立魔塔囚困了残留的恶兽。\n离开镇子出去闯荡时，他已经超越大元素使，\n到达了另一个恍若虚无缥缈的境界。",
        "沧海桑田，无数勇者自镇中崛起，\n他们拥有强大的实力，却日出而作，日落而息，\n守护着这一方小小的镇子。\n遗憾的是，在那一年之后，再也没有人见过传说勇者的踪影。",
        {
            "type": "setCurtain",
            "time": 600
        },
        "\t[旧时花]……这就是碑文的全部内容。\n在石碑内部还有用灵力书写的隐藏字样，\n介绍了魔塔的内部情况之类的。",
        "\t[旧时花]元素使，学徒对应初阶，见习对应诉阶，正统对应七曜灵境。\n大元素使，对应灵境巅峰二境。",
        "\t[眠时雪]那这个名叫“艾”的勇者，\n至少是梦之境的实力！\n真是向往啊，这才是真正的强者作风……",
        "\t[旧时花]魔塔共有50层，分为10个区域。\n其中第一区域，关押着各种初阶、诉阶的异兽。",
        "\t[旧时花]嗯，没什么兴趣呢，\n要不这里就给眠眠出手解决怎么样。",
        "\t[眠时雪]为什么这种事情要交给本眠啊，\n实力高得多的应该是本眠才对吧，对吧对吧！\n待遇完全反过来了啊喂！",
        "\t[旧时花]不过，或许可以搜集一些情报消息呢。\n总之，这里可以稍微划水一下……",
        "任务目标：通过魔塔的第一区域。",
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    9
                ]
            ],
            "remove": true
        },
        {
            "type": "follow",
            "name": "mian.png"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "L56",
            "loc": [
                6,
                0
            ]
        },
        "6,8": {
            "floorId": "MT58",
            "loc": [
                6,
                12
            ],
            "time": 500
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,10248,10249,10250,10251,10252,10253,10254,  0,  0,  0],
    [  0,  0,  0,10248,10249,10250,10251,10252,10253,10254,  0,  0,  0],
    [  0,  0,  0,10248,10249,10250,10251,10252,10253,10254,  0,  0,  0],
    [  0,  0,  0,10248,10249,10250,10251,10252,10253,10254,  0,  0,  0],
    [  0,  0,  0,10248,10249,10250,10251,10252,10253,10254,149,  0,  0],
    [  0,  0,149,10255,10256,10250,10251,10252,10257,10258,149,  0,  0],
    [  0,149,149,10266,10260,10261,10262,10263,10264,10265,149,149,  0],
    [149,149,149,149,10266,10267,10268,10269,10248,149,149,149,149],
    [149,149,149,149,  0,  0,355,  0,10271,149,149,149,149],
    [149,149,149,  0,  0,  0,  0,  0,  0,  0,149,149,149],
    [149,149,149,149,  0,  0,  0,  0,  0,149,149,149,149],
    [149,149,149,149,149,  0,  0,  0,149,149,149,149,149],
    [149,149,149,149,149,149,334,149,10266,149,149,149,149]
],
    "bgmap": [

],
    "fgmap": [
    [149,149,  0,  0,  0,  0,10272,  0,  0,  0,  0,149,149],
    [149,  0,  0,  0,  0,  0,10273,  0,  0,  0,  0,  0,149],
    [149,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,10272,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,10273,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,10274,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,10275,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [148,148,148,148,148,148,148,148,148,148,148,148,148],
    [148,148,148,148,148,148,  0,148,148,148,148,148,148],
    [148,148,148,148,148,  0,  0,  0,148,148,148,148,148],
    [148,148,148,148,  0,  0,  0,  0,  0,  0,148,148,148],
    [148,148,148,  0,  0,  0,  0,  0,  0,  0,  0,148,148],
    [148,148,  0,  0,  0,  0,  0,  0,  0,  0,  0,148,148],
    [148,  0,  0,  0,  0,10250,10251,10252,  0,  0,  0,  0,148],
    [  0,  0,  0,  0,  0,10250,10251,10252,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}