main.floors.MT3=
{
    "floorId": "MT3",
    "title": "主塔 3 层",
    "name": "3",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,1": [
            "看到第一層勇者留下的東西了，我也要留下點痕跡",
            "樓層傳送，肯定能夠幫上忙的!",
            "為了之後的勇者留在這裡",
            "---------第69勇者留",
            "\t[弱智,default]底下有一行小字寫了用法呢",
            "\t[弱智,default]樓層傳送器按下\"G\"即可打開，如果是手機的話可以打開虛擬鍵盤",
            "\t[弱智,default]這是什麼意思啊?"
        ],
        "5,5": [
            "蝙蝠類的怪物無論如何他都是先攻的",
            "而魔法類的怪物則無視護甲，需要速戰速決",
            "\t[弱智,default]這裡也有提示啊",
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        5
                    ]
                ],
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [144,144,144,144,144,144,144,144,144,144,144,144,144],
    [144,129,  2, 28,  2, 28,  2, 28,  2, 23,  2,  0,144],
    [144, 46,  2, 21,  2, 22,  2, 31,  2, 28,  2, 28,144],
    [144,  0,  2,202,  2,206,  2, 28,  2,217,  2, 27,144],
    [144,  0,  2,203,  2,205,  2,  0,  2,213,  2,  0,144],
    [144,  0,  2, 81,  2,129,  2, 82,  2,  0,  2,  0,144],
    [144,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,144],
    [144,  0,  2, 81,  2,  0,  2, 82,  2,  0,  2,205,144],
    [144,  0,  2,202,  2,205,  2,  0,  2,213,  2,203,144],
    [144,  0,  2,203,  2,206,  2, 27,  2,217,  2,205,144],
    [144,  0,  2, 21,  2, 22,  2, 31,  2, 27,  2,  0,144],
    [144, 88,  2, 27,  2, 27,  2, 27,  2, 23,  2, 87,144],
    [144,144,144,144,144,144,144,144,144,144,144,144,144]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "bgm.mp3"
}