main.floors.MT4_5=
{
    "floorId": "MT4_5",
    "title": "主塔 4.5 层",
    "name": "4.5",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "",
    "firstArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.turnHero(\"up\");\n}"
        },
        {
            "type": "sleep",
            "time": 200,
            "noSkip": true
        },
        {
            "type": "function",
            "function": "function(){\ncore.turnHero(\"right\");\n}"
        },
        {
            "type": "sleep",
            "time": 200,
            "noSkip": true
        },
        {
            "type": "function",
            "function": "function(){\ncore.turnHero(\"left\");\n}"
        },
        {
            "type": "sleep",
            "time": 200,
            "noSkip": true
        },
        "\t[弱智,default]這是，書庫?塔裡居然有這種地方",
        {
            "type": "setValue",
            "name": "temp:X",
            "value": "7"
        },
        {
            "type": "setValue",
            "name": "temp:Y",
            "value": "4"
        },
        {
            "type": "tip",
            "text": "再次点击闪烁位置确认"
        },
        {
            "type": "drawSelector",
            "image": "winskin.png",
            "code": 1,
            "x": "32*temp:X",
            "y": "32*temp:Y",
            "width": 32,
            "height": 32
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,4": [
            {
                "type": "drawSelector",
                "code": 1
            },
            "\t[弱智,default]「囚犯名冊」?這座塔以前竟然是關押犯人的?",
            "\t[弱智,default]怪了，那這座塔怎麼會變成現在的樣子汪",
            "\t[弱智,default]話說回來我記得這一帶以前是勇者國的領土來著，難不成這裡是勇者國的監獄?",
            "\t[弱智,default]但怎麼從來不記得我看過這一座塔，沒有、也沒有書在談論這裡",
            "\t[弱智,default]這座塔到底發生了甚麼汪",
            {
                "type": "animate",
                "name": "EMsikao",
                "loc": "hero"
            },
            "\t[???]原來你在這裡",
            {
                "type": "show",
                "loc": [
                    [
                        7,
                        6
                    ]
                ]
            },
            {
                "type": "jumpHero",
                "time": 300
            },
            {
                "type": "jumpHero",
                "time": 300
            },
            "\t[弱智,default]嗚痾，汪啊啊啊啊!",
            {
                "type": "function",
                "function": "function(){\ncore.turnHero(\"down\");\n}"
            },
            "\t[弱智,default]前輩你下可以不要了無聲息地出現在我背後嗎?",
            "\t[高興,Happy.png]甚麼叫了無聲息，我都已經在你背後吃完一碗麻辣燙你都沒理我",
            "\t[高興,Happy.png]我還以為你站著暈過去了",
            "\t[弱智,default]我怎麼可能會站著暈過......不對，我還真暈過汪",
            "\t[高興,Happy.png]不要在意這麼多細節，所以你在這邊發現了什麼",
            "\t[弱智,default]這邊的書紀錄著這座塔以前關押的犯人的資料汪",
            "\t[弱智,default]這裡以前是勇者國的監獄嗎?",
            "\t[弱智,default]我們國家竟然還有會犯罪後被抓到這裡的人汪?",
            "\t[高興,Happy.png]對啊，你不知道嗎?",
            "\t[高興,Happy.png]勇者國在創立之時，便會通過一種特殊的魔法聚集所有國民的怨念與負面情緒，讓大家都陽光又正向",
            "\t[弱智,default]那我呢汪?",
            "\t[高興,Happy.png]就我所知懦弱跟自卑不在這個魔法的處理範圍",
            {
                "type": "animate",
                "name": "EMyiwen",
                "loc": "hero"
            },
            "\t[弱智,default]可惡，連魔法都拯救不了我嗎汪！kuso！",
            "\t[弱智,default]那前輩你呢?你的負面......不對，你不管在甚麼地方就沒有負面的時候",
            "\t[高興,Happy.png]這就是高興流的奧義，把自身化為太陽吧，弱智",
            "\t[弱智,default]學不來啦汪",
            "\t[高興,Happy.png]當然總有些人的負面情緒強大到無法吸收，就被關進來這裡了",
            "\t[弱智,default]不過，那些負面情緒去哪了汪",
            "\t[弱智,default]總不可能就只是吸收了吧汪",
            "\t[高興,Happy.png]這個我就不知道了，畢竟這個跟推廣麻辣燙沒什麼關係",
            "\t[弱智,default]前面那些就跟麻辣燙有關係嗎汪!?",
            "\t[高興,Happy.png]那當然，原本是想把麻辣燙推廣到全國各地的，所以順便看了這區的資料",
            "\t[弱智,default]這種地方竟然圓的上嗎，臥槽!?",
            "\t[高興,Happy.png]過我沒時間處理這裡了，麻辣燙研討會的時間快到了，再不去就要遲到了",
            "\t[高興,Happy.png]保護公主跟解決這座塔的問題就交給你了",
            "\t[弱智,default]我?",
            "\t[高興,Happy.png]對，你，有甚麼疑惑嗎?",
            "\t[弱智,default]痾......我......",
            "\t[高興,Happy.png]你都已經能夠自己來到這裡了，你並沒有你自己說的那麼無能吧",
            "\t[高興,Happy.png]總之我看好你",
            {
                "type": "animate",
                "name": "EMsikao",
                "loc": "hero"
            },
            "\t[高興,Happy.png]對了，忘記告訴你，這座塔是在勇者國成立很久之後才蓋的",
            "\t[高興,Happy.png]在最開始的時候，這裡表面上似乎是個儲藏軍備的地窖來著",
            "\t[高興,Happy.png]我知道的就這些了，之後再連絡",
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "animate",
                "name": "EMsikao",
                "loc": "hero"
            },
            "\t[弱智,default]我不無能......嗎?",
            "\t[弱智,default]先前進吧",
            {
                "type": "setValue",
                "name": "flag:TrueEnd",
                "value": "1"
            }
        ],
        "7,6": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "6,11": {
            "floorId": "MT5",
            "loc": [
                6,
                3
            ],
            "direction": "down"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [141,141,141,141,141,141,141,141,141,141,141,141,141],
    [141,141,  0,20099,  0,20152,20153,  0,  0,20099,  0,141,141],
    [141,141,20124,  0,  0,20160,20161,20128,20129,20128,20129,141,141],
    [141,141,20132,  0,  0,  0,  0,20136,20137,20136,20137,141,141],
    [141,141,  0,  0,  0,  0,10165,20144,20145,20144,20145,141,141],
    [141,141,50056,50041,  0,  0,10173,  0,  0,  0,  0,141,141],
    [141,141,50064,50041,  0,  0,  0,353,  0,  0,  0,141,141],
    [141,141,  0,  0,  0,  0,  0,  0,  0,  0,  0,141,141],
    [141,141,  0,40068,40069,  0,  0,  0,40070,40071,  0,141,141],
    [141,141,  0,40076,40077,  0,  0,  0,40078,40079,  0,141,141],
    [141,141,  0,40084,40085,  0,  0,  0,40086,40087,  0,141,141],
    [141,141,141,141,141,141,70193,141,141,141,141,141,141],
    [141,141,141,141,141,141,141,141,141,141,141,141,141]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,20049,20049,20049,20049,20049,20049,20049,20049,20049,  0,  0],
    [  0,  0,20049,20049,20049,20049,20049,20049,20049,20049,20049,  0,  0],
    [  0,  0,60032,60033,60033,60033,60033,60033,60033,60033,60034,  0,  0],
    [  0,  0,60040,60041,60041,60041,60041,60041,60041,60041,60042,  0,  0],
    [  0,  0,60040,60041,60041,60041,60041,60041,60041,60041,60042,  0,  0],
    [  0,  0,60040,60041,60041,60041,60041,60041,60041,60041,60042,  0,  0],
    [  0,  0,60040,60041,60041,60041,60041,60041,60041,60041,60042,  0,  0],
    [  0,  0,60040,60041,60041,60041,60041,60041,60041,60041,60042,  0,  0],
    [  0,  0,60040,60041,60041,60041,60041,60041,60041,60041,60042,  0,  0],
    [  0,  0,60048,60049,60049,60049,60049,60049,60049,60049,60050,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "upFloor": [
        6,
        10
    ],
    "downFloor": [
        6,
        10
    ],
    "flyPoint": [
        6,
        10
    ],
    "bgm": "bgm.mp3"
}