main.floors.story_4=
{
    "floorId": "story_4",
    "title": "家裡",
    "name": "家裡",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "cannotMoveDirectly": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "X80009",
    "firstArrive": [
        {
            "type": "loadBgm",
            "name": "gold.mp3"
        },
        {
            "type": "setValue",
            "name": "flag:__story4Flag__",
            "value": "0"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,6": [
            "\t[弱智,default]需要的東西應該在這個房間裡都能找到",
            {
                "type": "moveHero",
                "steps": [
                    "right:1"
                ]
            }
        ],
        "12,6": [
            "\t[弱智,default]需要的東西應該在這個房間裡都能找到",
            {
                "type": "moveHero",
                "steps": [
                    "left:1"
                ]
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "1,9": {
            "0": {
                "condition": "core.getHeroLoc('y') ===11",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "animate",
                        "name": "EMsikao",
                        "loc": [
                            6,
                            11
                        ]
                    },
                    "\t[弱智,default]不對",
                    "\t[弱智,default]不對不對不對 不對不對不對 不對不對不對 不對不對不對",
                    "\t[弱智,default]不行的阿，我做不到阿，幹這就是平常訓練少的後果嗎，完全做不到哇",
                    "\t[弱智,default]反正勇者國的所有人都那麼正直又富有正義感，那些不是勇者的人稍微訓練一下肯\n定就比我強了吧",
                    "\t[弱智,default]仔細想想，我們國家的畫風也太奇怪了吧，為甚麼所有人都那麼陽光正向阿，我的\n陰暗面都被淨化了阿",
                    "\t[弱智,default]為甚麼會有人闖進別人的房子後只幫人家照顧小孩跟整理房子的",
                    "\t[弱智,default]發生衝突後過沒十秒就開心地互相祝福對方又是什麼鬼啦",
                    {
                        "type": "animate",
                        "name": "EMsikao",
                        "loc": [
                            6,
                            11
                        ]
                    },
                    "\t[弱智,default]好像...也只能走了，從勇者國被趕出去我就完了啊",
                    "\t[弱智,default]......收拾收拾走了吧，該去那座「魔塔」",
                    "\t[弱智,default]至少需要劍、盾才能算勇者吧，另外錢還是要帶的"
                ]
            },
            "1": null
        },
        "1,8": {
            "1": null
        },
        "6,12": {
            "0": {
                "condition": "core.getHeroLoc('y') ===12  ",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": true,
                "data": [
                    {
                        "type": "if",
                        "condition": "(flag:__story4Flag__<2)",
                        "true": [
                            "\t[弱智,default]東西還沒拿呢",
                            {
                                "type": "exit"
                            }
                        ]
                    },
                    {
                        "type": "if",
                        "condition": "(core.status.hero.money<1000)",
                        "true": [
                            "\t[弱智,default]錢還沒拿呢",
                            {
                                "type": "exit"
                            }
                        ]
                    },
                    {
                        "type": "if",
                        "condition": "core.hasEquip('sword5')",
                        "true": [
                            {
                                "type": "if",
                                "condition": "core.hasEquip('shield5')",
                                "true": [
                                    "\t[弱智,default]是時候出發去那座「魔塔」了",
                                    {
                                        "type": "changeFloor",
                                        "floorId": ":next"
                                    }
                                ],
                                "false": [
                                    "\t[弱智,default]只是拿著沒有用啊，要把東西穿上去才行"
                                ]
                            }
                        ],
                        "false": [
                            "\t[弱智,default]只是拿著沒有用啊，要把東西穿上去才行"
                        ]
                    }
                ]
            },
            "1": null
        },
        "11,11": {
            "0": {
                "condition": "core.hasItem('shield5')",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    "\t[弱智,default]盾牌...要怎麼用啊",
                    {
                        "type": "setValue",
                        "name": "flag:__story4Flag__",
                        "operator": "+=",
                        "value": "1"
                    }
                ]
            },
            "1": null
        },
        "11,3": {
            "0": {
                "condition": "core.hasItem('sword5')",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    "\t[弱智,default]雖然我不太懂這些東西，但爸媽買的應該不會差吧",
                    {
                        "type": "setValue",
                        "name": "flag:__story4Flag__",
                        "operator": "+=",
                        "value": "1"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [141,141,141,141,141,141,141,141,141,141,141,141,141],
    [141,  0,  0,  0,  0,20154,20155,80069,80070,80069,80070,  0,141],
    [141,20141,  0,  0,  0,20162,20163,80077,80078,80077,80078,  0,141],
    [141,20149,345,345,345,  0,  0,80085,80086,80085,80086, 43,141],
    [141,  0,  0,  0,  0,80060,80060,80060,  0,  0,  0,  0,141],
    [141,  0,  0,  0,  0,80068,80068,80068,  0,  0,  0,  0,141],
    [  0,  0,  0,  0,  0,20088,20089,20090,  0,  0,  0,  0,  0],
    [141,  0,  0,  0,  0,20096,20097,20098,  0,  0,  0,  0,141],
    [141,  0,  0,  0,  0,20104,20105,20106,  0,  0,  0,  0,141],
    [141,  0,  0,  0,  0,80076,80076,80076,  0,  0,  0,  0,141],
    [141,345,  0,  0,  0,80084,80084,80084,  0,80163,80164,  0,141],
    [141,345,345,  0,  0,  0,  0,  0,  0,80171,80172, 44,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141]
],
    "bgmap": [
    [20004,20004,20004,20004,20004,20004,20004,20004,20004,20004,20004,20004,20004],
    [20004,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20004],
    [20004,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20049,20004],
    [20004,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20004],
    [20004,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20004],
    [20004,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20004],
    [20004,  0,140,140,140,140,140,140,140,140,140,  0,20004],
    [20004,  0,140,140,140,140,140,140,140,140,140,  0,141],
    [20004,  0,140,140,140,140,140,140,140,140,140,  0,20004],
    [20004,  0,140,140,140,140,140,140,140,140,140,  0,20004],
    [20004,  0,140,140,140,140,140,140,140,140,140,  0,20004],
    [20004,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20004],
    [20004,20004,20004,20004,20004,20004,20004,20004,20004,20004,20004,20004,20004]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80158,  0,80175,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80055,80143,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "upFloor": [
        6,
        12
    ],
    "downFloor": [
        6,
        11
    ],
    "flyPoint": [
        6,
        11
    ],
    "bgm": "Town_real2_mvt.m4a"
}